/* 白细胞觉醒 */
const LEVEL_1 = {
  name: '白细胞觉醒',
  width: 135,
  cellType: 3,
  winCondition: WIN_COLLECT_ALL,
  sky: [C.sky2, '#e8a0a0'],
  map: [
      "                                                                                                                                       ",
      "                        ?                                                                                                              ",
      "                                                                                                                                       ",
      "                                                                                                                                       ",
      "             ?                                                                                                                         ",
      "                       ooo                     ooo             ??                                       ?                              ",
      "        oo  o     ooo  ===                 oo  ===                                          t                                          ",
      "        ==  ^ o   ===            a     p   ==                          o^o    oo        o====                                          ",
      "      =     ===                 o o    p            ===    ooo ==      ===    ==   p   o==                                             ",
      "                               o   o  =p                                           p   =                p  aaaaaaaaaaaaaaa             ",
      "P                             o  G  o= p       t    ooooo   g     t                p                    p  aaaaaaaaaaaaaaa      b      ",
      "#######################################p###########################################p####################p##############################",
      "#######################################p###########################################p####################p##############################",
      "#######################################p###########################################p####################p##############################",
  ],
  floatPlatforms: [],
  pipeSpawners: [
    { col:75, row:7, dir:'up', trigger:'contact' },
    { col:39, row:7, dir:'up_jump', trigger:'contact' }
  ],
  tutorials: [],
  knowledgeCards: [
    { x:32, key:'wbc', title:'白细胞', text:'白细胞是抵御伤口感染的先锋。当细菌通过擦伤创面入侵身体，白细胞会奔赴患处，吞噬并消灭病菌。我们看到的脓液，很多是英勇作战后牺牲的白细胞。' }
  ],
};
