/* 皮肤防线·擦伤 */
const LEVEL_SKIN = {
  name: '皮肤防线·擦伤',
  width: 135,
  cellType: 3,
  winCondition: WIN_COLLECT_ALL,
  sky: [C.sky2, '#e8a0a0'],
  map: [
      "                                                                                                                                       ",
      "                                                                                                                                       ",
      "                                                                                                                                       ",
      "                                                                                                                                       ",
      "                                                                                                                                       ",
      "                           ?                                                                            ?                              ",
      "                                     O                         c         O                                              c              ",
      "                     O            =======               O             ppppppp    ?         Ot                        ========          ",
      "                  =======                            =======         =                  =======        ===       ==                    ",
      "                           =   ==                              =   ==                               ==     ==                          ",
      "          O   g                   t          C    O     G                     g      ==        CO                 g               F    ",
      "P######################################################################################################################################",
      "#######################################################################################################################################",
      "#######################################################################################################################################",
  ],
  floatPlatforms: [],
  pipeSpawners: [],
  tutorials: [],
  knowledgeCards: [
    { x:33, key:'skin', title:'皮肤防线', text:'皮肤是身体的第一道物理屏障。当擦伤破坏这道防线，金黄色葡萄球菌、链球菌等细菌便会趁机入侵。此时白细胞迅速奔赴创面吞噬杀菌，红细胞则加紧输送氧气与二氧化碳，维持局部代谢。守住防线，别让感染扩大！' },
    { x:0, key:'wbc', title:'', text:'' }
  ],
};
