/* 擦伤 */
const LEVEL_1 = {
  name: '擦伤',
  width: 80,
  cellType: 3,
  winCondition: WIN_COLLECT_ALL,
  sky: [C.sky2, '#e8a0a0'],
  map: [
      "                                                                                ",
      "                                                                                ",
      "                                                                                ",
      "                                                                                ",
      "                                                                                ",
      "                                                                                ",
      "                                 o                                              ",
      "                           f    ===   n                                         ",
      "                      n   ===        ===   o                                    ",
      "                o    ===                  ===   C                               ",
      "           n   ===                             ===   d        O                 ",
      "          ===                                       ===     ====                ",
      "  P  o o g       C                                  g  tb===                F   ",
      "##################   ######################################       ##############",
      "##################   ######################################       ##############",
  ],
  floatPlatforms: [],
  pipeSpawners: [],
  tutorials: [
    { x:1750, useCurrent:true, body:'前方是终点大门！\nBoss细菌守在门前\n只有白细胞能伤害Boss\n击杀Boss后门会解锁\n走到门前即可通关！' }
  ],
  knowledgeCards: [
    { x:2, key:'wbc', title:'白细胞', text:'嘿！我是白细胞。\n白细胞，将自体外入侵至体内的细菌与病毒等异物排除干净，是白细胞的主要工作。人类血液中的白细胞有一半以上都是中性粒细胞。\n前方有细菌出没，按 1 切换到白细胞！白细胞能消灭细菌，跳到细菌头顶踩踏消灭或按 E 挥剑斩杀！\n← → 或 A D 移动\n空格 / W / ↑ 跳跃\n长按跳更高，空中再按一次二段跳！' },
    { x:440, y:310, key:'rbc', title:'红细胞', text:'看到粉色营养包了吗？\n按 3 切换到红细胞才能收集，营养包可以恢复大量能量\n红细胞，可通过血液循环将氧气和二氧化碳在体内运送。营养包只有红细胞能收集哦。' },
    { x:1700, key:'plt', title:'血小板', text:'嘿！我是血小板。血小板，血液中含有的一种细胞成分，会在血管受损时集结，堵住伤口进行止血。前方有断裂缺口，按 2 切换到血小板，按 E 消耗能量生成凝血平台，注意能量是否充足！' }
  ],
};
